[
    {
        "title": "Site Builders",
        "slug": "sb",
        "image": "src/assets/undraw_building_blocks.svg",
        "description": "Platforms designed for building a website without code. They often use drag-and-drop editors, making them user-friendly for beginners. However, they can have limited flexibility that drives users to premium plans.",
        "examples": "Examples: Squarespace, Shopify, Wix, Google Sites, and more.",
        "factors": {
            "customization": "With limited options, they mainly use pre-designed templates and often upcharge. You end up working backwards squeezing content into a generic design.",
            "ease-of-use": "Platforms are designed with ease of use in mind, offering drag-and-drop functionality and templates that make it quick and simple for non-technical users.",
            "accessibility": "Some site builders have basic accessibility features, but they usually require additional work or third-party tools to fully meet web standards.",
            "up-front-costs": "Typically low initial costs, as many site builders offer free or low-cost plans. However, their ultimate goal is to drive you to more expensive premium plans.",
            "ongoing-costs": "Ongoing costs can pile up through monthly subscription fees for premium features, hosting, or advanced tools, increasing over time as your needs grow.",
            "value-for-money": "Great for individuals looking to quickly set up a website on a budget, but the lack of customization will limit growth and long-term satisfaction.",
            "performance": "Performance is generally solid for smaller websites but may decrease when more content and complex features or higher traffic volumes are introduced.",
            "security": "Basic security measures are included, but you must regularly update plugins or rely on platform-level security updates to keep their sites safe from threats.",
            "scalability": "Site builders can work for small sites but will struggle with scalability as your business grows, particularly when additional features or traffic spikes are involved.",
            "features-integrations": "While many platforms offer integrations with third-party apps, the scope of these integrations may be limited and often involves upcharges.",
            "support-maintenance": "You can dig through help articles or community forums for support, or end up pying for a premium plan for personalized support with varying response times.",
            "workload": "Templates actually take lots of work to customize, as you're figuring out how to gather and structure content. The long road of updates and maintenance lies ahead.",
            "development-time": "They advertise quick setup and claim users can launch sites in hours or days, bit in reality customization or complex functionality takes much more time.",
            "ownership": "Ownership is typically retained by you, but platforms can impose their own restrictions that limit flexibility, and often grant themselves rights to your content."
        }
    },
    {
        "title": "Freelancers",
        "slug": "fr",
        "image": "src/assets/undraw_digital_nomad.svg",
        "description": "Freelancers are independent professionals who can offer tailored website design and development services. They can provide personalized, custom solutions but their availability, expertise, and pricing will vary significantly.",
        "examples": "Examples: can be found on sites like Fiverr and Upwork.",
        "factors": {
            "customization": "Freelancers can offer tailored designs, but many still rely on templates for efficiency. You can get full customization if you find a good one.",
            "ease-of-use": "The ease of use depends on the freelancer's approach and the tools they're using. They may not always focus on simplifying the backend for clients.",
            "accessibility": "Accessibility is often included in the design process, but its implementation depends on the freelancer's experience and attention to detail.",
            "up-front-costs": "Freelancer pricing can vary widely depending on the scope of the project, expertise, and market rates. Packages offered may or may not fit your exact needs.",
            "ongoing-costs": "Ongoing costs will typically depend on the freelancer's availability for updates or maintenance and may involve premium plans for hosting and support services.",
            "value-for-money": "Can provide good value for the money, especially when you need a custom solution, but there's high variability in quality that can be diffcult to predict.",
            "performance": "Websites can perform well if optimized correctly, though performance will depend on the freelancer's expertise and experience with performance optimization.",
            "security": "Security will depend on the freelancer's practices, as measures must be integrated during development. Updates may require re-engaging them for maintenance.",
            "scalability": "Scaling a site as your business grows may require additional work, especially if your freelancer isn't available for long-term projects.",
            "features-integrations": "Freelancers can build custom features and integrate third-party tools, depending on their skill set. However, complexity comes with costs.",
            "support-maintenance": "Support is available but typically limited to project scope. For ongoing updates, you will need to hire the freelancer again or find a new one.",
            "workload": "Freelancers handle the development work, but you will need to keep close tabs througout the process to ensure all decision-making aligns with your vision.",
            "development-time": "Development time can vary based on the freelancer's availability and the scope of the project. Shorter promises for turnaround times can mean lower quality.",
            "ownership": "Typically you get full ownership of the final product, though it's important to clarify code ownership and licensing for any custom work in the contract."
        }
    },
    {
        "title": "Agencies",
        "slug": "ag",
        "image": "src/assets/undraw_team_page.svg",
        "description": "Agencies offer comprehensive services with teams of designers, developers, and project managers. They provide full-scale solutions for complex needs, but the tradeoff is higher costs and communication complexities.",
        "examples": "Examples: Professional web development firms, local or online.",
        "factors": {
            "customization": "Most offer highly customized solutions, tailor everything from design to functionality to fit your goals, and ensure a premium and unique online presence.",
            "ease-of-use": "Agencies often prioritize ease of use, building intuitive interfaces and streamlined admin panels for management of your site's content and operations.",
            "accessibility": "Usually a top priority, but it always depends on the agency you choose and possibly even the specific developer assigned to your project.",
            "up-front-costs": "Typically require a higher up-front investment due to the comprehensive nature of their services. Flexibility of packages and service offerins will vary widely.",
            "ongoing-costs": "Maintenance, support, and additional services will require premium plans or higher fees, and costs will continue to pile up as your business evolves.",
            "value-for-money": "They offer premium service and can deliver high-quality, scalable results, but their higher costs are out of reach for those with limited budgets.",
            "performance": "Websites are usually built with optimization in mind, often using the latest technologies and performance-enhancing techniques to ensure speed and reliability.",
            "security": "Security may be a priority, the agency must incorporate measures such as encryption, regular updates, and vulnerability testing to protect your site from threats.",
            "scalability": "Depends on the agency, but sites usually can handle increased traffic, expanded functionality, and larger user bases with ease as your business grows.",
            "features-integrations": "Most agency developers can integrate complex features and third-party tools, but communication may be challenging with rotating representatives.",
            "support-maintenance": "Typically provide long-term support and maintenance, though dealing with multiple representatives can cause confusion and premium plans may be required.",
            "workload": "The workload for you is reduced, as the agency manages most aspects of the project, but ongoing communication and decision-making can still become burdensome.",
            "development-time": "While some agencies promise quick turnarounds, the more complex the project, the longer it may take. Speed may come at the cost of detail orientation.",
            "ownership": "You generally retain ownership of the site and contents, though contracts should be reviewed to clarify ownership of the underlying code and intellectual property."
        }
    },
    {
        "title": "WordPress",
        "slug": "wp",
        "image": "src/assets/undraw_advanced_customization.svg",
        "description": "Open source software that powers almost half of websites worldwide. Known for its wide range of options, themes, and plugins. Also notourious for security breeches and slow page loads because it's server-based.",
        "examples": "Examples: Many companies offer self-hosted or managed hosting options",
        "factors": {
            "customization": "Vast library of themes, plugins, and custom coding capabilities create almost endless possibilities, but these all take decent level expertise to implement.",
            "ease-of-use": "The backend will require a learning curve for most users building a site. Options and menus are layered and can be overwhelming to navigate for simple adjustments.",
            "accessibility": "Offers some accessibility features, but achieving full compliance will require additional configuration, theme adjustments, and even accessibility plugins.",
            "up-front-costs": "WordPress itself is free to use, but costs will add up with premium themes, plugins, hosting, and professional development, especially for more advanced websites.",
            "ongoing-costs": "Hosting fees, premium themes, plugins, and security measures will each require costly subscription, on top of any custom development or maintenance work.",
            "value-for-money": "With such a large ecosystem there is plenty of flexibility, but the wide-ranging costs of premium features can tip the scales, especially for complex sites.",
            "performance": "Performance depends on the quality of hosting and optimization efforts. Premium tools can improve speed, but will never match the speed of a static site.",
            "security": "Users must manage updates, plugins, and other security measures proactively. The plugins you use and general popularity of WordPress increases your site's vulnerability.",
            "scalability": "Can scale well with the right hosting environment and optimizations, but larger sites will require additional work to ensure they perform well as they grow.",
            "features-integrations": "With thousands of plugins and themes, there are integrations and feature options for almost everything, but the higest quality ones are never free.",
            "support-maintenance": "You'll find plenty of community-based support, and some hosts offer paid support services. Constant updates are required to keep the site secure and functional.",
            "workload": "The learning curve is a steep one, especially for complex features. Updates require constant vigilance, but managed hosting options can reduce the burden at a cost.",
            "development-time": "Development time can be quick if using existing themes and plugins, but custom development and theme modifications will take additional time to complete.",
            "ownership": "Your site belongs to you, but licensing for hosting and each theme, plugin, and tool you're using will have to be carefully reviewed to ensure full ownership rights."
        }
    }
]