{
    "customization": "Fully customized designs tailored to your brand's unique needs, ensuring a distinctive and polished online presence that resonates with your target audience.",
    "ease-of-use": "User-friendly admin panels and tools built specifically for your workflow, simplifying site management while saving you time and reducing complexity.",
    "accessibility": "Every site is built with web accessibility as a priority, adhering to global standards to ensure inclusivity and an optimal experience for all users.",
    "up-front-costs": "Affordable up-front pricing with clear itemization, giving you transparency and control over your investment without hidden fees.",
    "ongoing-costs": "Minimal ongoing costs after initial setup, depending on your hosting plan, allowing you to budget effectively without unexpected expenses.",
    "value-for-money": "A high-value solution designed to grow with your business, offering exceptional return on investment and scalability to meet evolving needs.",
    "performance": "Optimized for fast loading and smooth interactions, providing users with an efficient browsing experience that enhances engagement and satisfaction.",
    "security": "Built-in security measures to protect your site and user data, incorporating best practices and proactive strategies to mitigate risks.",
    "scalability": "Designed to scale seamlessly as your business grows, accommodating increased traffic, additional features, and evolving requirements effortlessly.",
    "features-integrations": "Custom features and integrations for unique functionality, empowering your website to align perfectly with your operational and strategic goals.",
    "support-maintenance": "Ongoing support and maintenance plans available, ensuring your website remains up-to-date, secure, and fully functional without added stress.",
    "workload": "I handle the heavy lifting, so you can focus on your business, delivering a streamlined process that minimizes your time and effort.",
    "development-time": "Typically ready in 4–6 weeks, depending on complexity, striking a balance between thorough development and a timely launch.",
    "ownership": "You own the site outright, with no strings attached, granting you complete control and the flexibility to make future changes as needed."
}