{
    "customization": "Fully customized designs tailored to your brand's unique needs, ensuring a distinctive and polished online presence that resonates with your target audience.",
    "ease-of-use": "User-friendly admin panel built specifically around your content structure, simplifying site management while saving you time and reducing complexity.",
    "accessibility": "Every site is built with web accessibility as a priority, adhering to global standards to ensure inclusivity and an optimal experience for all users.",
    "up-front-costs": "Affordable up-front pricing with clear itemization, giving you transparency and control over your investment without overpaying for features you don't need.",
    "ongoing-costs": "Minimal and optional ongoing costs after initial setup, depending on your site's needs, allowing you to budget effectively without unexpected expenses.",
    "value-for-money": "You're able to avoid the frustrations of website and online business development while setting yourself and your brand up for future growth.",
    "performance": "Your site is built with static code and hosted on a cloud platform designed to handle massive traffic, so it's fast, reliable, and ready to grow with your needs.",
    "security": "Enterprise-grade security protects your site from threats like hacking and data breaches, with automatic updates and safeguards built into the hosting platform.",
    "scalability": "Designed to scale seamlessly as your business grows, accommodating increased traffic, additional features, and evolving requirements effortlessly.",
    "features-integrations": "Custom features and integrations to make your website do all the things you need it to do, fitting your goals and the way you run things.",
    "support-maintenance": "theRamoShe offers support sessions on any topic, anytime, and can provide custom contracts for any site updates and/or feature expansions.",
    "workload": "theRamoShe handles the heavy lifting, so you can focus on your business, delivering a streamlined process that minimizes your time and effort.",
    "development-time": "Typically ready in 8-12 weeks, depending on size and complexity of project, striking a balance between thorough development and a timely launch.",
    "ownership": "You own the site all the way down to the code, with no strings attached, granting you complete control and the flexibility to make future changes as needed."
}